---
type: SweptBlend
namespace: Autodesk.Revit.DB
version: 2024
members: 11
tags: [revit-api, class]
---

# SweptBlend

`Autodesk.Revit.DB.SweptBlend` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetVertexConnectionMap | — | `public VertexIndexPairArray GetVertexConnectionMap ()` |
| Method | SetVertexConnectionMap | — | `public void SetVertexConnectionMap ( VertexIndexPairArray vertexMap )` |
| Property | BottomProfile | — | `public CurveArrArray BottomProfile { get ; }` |
| Property | BottomProfileSymbol | — | `public FamilySymbolProfile BottomProfileSymbol { get ; }` |
| Property | BottomSketch | — | `public Sketch BottomSketch { get ; }` |
| Property | Parameter | — | `` |
| Property | PathSketch | — | `public Sketch PathSketch { get ; }` |
| Property | SelectedPath | — | `public Curve SelectedPath { get ; }` |
| Property | TopProfile | — | `public CurveArrArray TopProfile { get ; }` |
| Property | TopProfileSymbol | — | `public FamilySymbolProfile TopProfileSymbol { get ; }` |
| Property | TopSketch | — | `public Sketch TopSketch { get ; }` |